# 2) დეტალურად აღწერეთ თუ რა განსხვავებაა ბრჭყალებში ჩაწერილ რიცხვსა და ჩვეულებრივ ინტეჯერ რიცხვს შორის?

# ბრჭყალებში ჩაწერილი რიცხვი აღიქმევა როგორც სტრინგი ხოლო ინტენჯერი ჩვეულებრივი რიცხვია ანუ აღიქმევა როგორც ჩვეულებრივი რიცხვი

# 3) დღეს ნასწავლ თითოეულ მათემატიკურ ოპერატორზე გააკეთეთ 5-5 მაგალითი სხვადასხვა რიცხვებით და თითოეულის შედეგი გამოიტანეთ ტერმინალში.

print(50 + 10)
print(60 + 10)
print(70 + 10)
print(80 + 10)
print(90 + 10)
print(50 - 10)
print(60 - 10)
print(70 - 10)
print(80 - 10)
print(90 - 10)
print(60 * 10)
print(70 * 10)
print(80 * 10)
print(50 * 10)
print(90 * 10)
print(60 / 10)
print(70 / 10)
print(80 / 10)
print(90 / 10)
print(50 / 10)

# 4) შექმენით ორი ცვლადი და თითოეულში შეინახეთ რიცხვები. შექმენით ოთხი ცვლადი: 
# • Addition
# • Substraction
# • Multiplication
# • Division
# და მოცემულ შესაბამის ცვლადებში შეინახეთ რიცხვებს შორის განხორციელებული მათემატიკური ოპერაციები.

num1 = 50
num2 = 10

Addition = 50 + 10
Substraction = 50 - 10
Multiplication = 50 * 10
Division = 50 / 10


