# 2) ახსენით თუ რისთვის არის საჭირო კარგი პრაქტიკების გამოყენება კოდის წერის დროს;

# 3) შექმენით ორი ცვლადი და მათში შეინახეთ რიცხვები. შეასრულეთ ყველა ის მათემატიკური ოპერაცია, რაც აქამდე ვისწავლეთ და თითოეული ეს ოპერაცია შეინახეთ ცვლადებში. საბოლოოდ დაბეჭდეთ ამ ცვლადის მნიშვნელობები. რაც ყველაზე მთავარია - ამ დავალების შესრულებისას, თითოეულ ხაზზე კომენტარიებით უნდა ახსნათ თუ რა მოქმედებებს ასრულებთ.

# 4) აუცილებლად დაასრულეთ საკლასო ვისაც არ დაგისრულებიათ: 

# გაასწორეთ მოცემული კოდები:

# 1. first_user = "Lika"
# 2nduser = "Giorgi"
# print(first user)

# 2. first name = Data
# last % name = "random"

# 3. რას გამოიტანს ეს კოდი?
# Num1 = 20
# num2 = 30
# print(num1 + num2)
# შედეგი ახსენით კომენტარებით.