
# 4) თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში გვჭირდება ის, ასევე ასხენით თუ რა დანიშნულება აქვს კომენტარს Python-ში.

# ცვლადი არის კონტეინერი რომელშიც ინახება ნებისმიერი ტიპის ინფო
# კომენტარი გვეხმარება რაღაცის ახსნაში, და ინფორმაციის დასატოვებლად.

# 5) გაიხსენეთ ყველა ის მონაცემთა ტიპი, რომელიც ვისწავლეთ. თითოეული ამოწერეთ Python-ის ფაილში და print() ბრძანების საშუალებით დაბეჭდეთ თითოეული მონაცემთა ტიპის 5-5 მაგალითი (Boolean-ის შემთხვევაში მხოლოდ 2 მაგალითი).

num1 = "1"
num2 = "2"
num3 = "3"
num4 = "4"
num5 = "5"
num6 = 1
num7 = 2
num8 = 3
num9 = 4
num10 = 5
num11 = 1.1
num12 = 1.2
num13 = 1.5
num14 = 13.7
num15 = 1345.87
num16 = True
num17 = False


