# 2) ახსენით თუ რისთვის არის საჭირო კარგი პრაქტიკების გამოყენება კოდის წერის დროს;
# კომენყტარი კარგია ახსნისთვის ვიყენებთ იმისთვის რომ გავიხსენოთ და ავხსნათ თითოეული კოდი

# 3) შექმენით ორი ცვლადი და მათში შეინახეთ რიცხვები. შეასრულეთ ყველა ის მათემატიკური ოპერაცია, რაც აქამდე ვისწავლეთ და თითოეული ეს ოპერაცია შეინახეთ ცვლადებში. საბოლოოდ დაბეჭდეთ ამ ცვლადის მნიშვნელობები. რაც ყველაზე მთავარია - ამ დავალების შესრულებისას, თითოეულ ხაზზე კომენტარიებით უნდა ახსნათ თუ რა მოქმედებებს ასრულებთ.
num = 50 #შევქმენით პირველი ცვლადი
num1 = 10 # შევქმენით მეორე ცვლადი
addition = num + num1   #დავუმატეთ ეს ცვლადები
substraction = num - num1  #გამოვაკელით ეს ცვლადები
multiplication = num * num1  #გავამრავლეთ ეს ცვლადები
division1 = num / num1  #გავყავით ეს ცვლადები და შედეგი იქნება float
division2 = num // num1 #გავყავით ეს ცვლადები და შედეგი იქნება integer
division3 = num % num1  # გავყავით ეს ცვლადები თუმცა შედეგში გამოიტანს მხოლოდ ნაშთს
Exponentiation = num**num1  # ავახარისხეთ ეს ცვლადები
print(addition, substraction, multiplication, division1, division2, division3, Exponentiation)  #გამოვიტანეთ შედეგები


# გაასწორეთ მოცემული კოდები:

# 1. first_user = "Lika"
# 2nduser = "Giorgi"
# print(first user)
first_user = "Lika"
second_user = "Giorgi"
print(first_user)

# 2. first name = Data
# last % name = "random"
first_name = "Data"
last_name = "random"

# 3. რას გამოიტანს ეს კოდი?
# Num1 = 20
# num2 = 30
# print(num1 + num2)
# შედეგი ახსენით კომენტარებით.
# გამოიტან ერორს იმიტომ რომ პრინტში უნდა ეწეროს Num1 თუმცა წერია num1 ანუ პატარა ასოთი